damellis/attiny/attiny/avr/boards.txt
menu.cpu=Processor
menu.clock=Clock

attiny.name=ATtiny
attiny.bootloader.tool=avrdude
attiny.bootloader.unlock_bits=0xff
attiny.bootloader.lock_bits=0xff

menu.cpu.attiny.attiny45=ATtiny45
menu.cpu.attiny.attiny45.upload.maximum_size=4096
menu.cpu.attiny.attiny45.build.mcu=attiny45
menu.cpu.attiny.attiny45.build.core=arduino:arduino
menu.cpu.attiny.attiny45.build.variant=tiny8

menu.cpu.attiny.attiny85=ATtiny85
menu.cpu.attiny.attiny85.upload.maximum_size=8192
menu.cpu.attiny.attiny85.build.mcu=attiny85
menu.cpu.attiny.attiny85.build.core=arduino:arduino
menu.cpu.attiny.attiny85.build.variant=tiny8

menu.cpu.attiny.attiny44=ATtiny44
menu.cpu.attiny.attiny44.upload.maximum_size=4096
menu.cpu.attiny.attiny44.build.mcu=attiny44
menu.cpu.attiny.attiny44.build.core=arduino:arduino
menu.cpu.attiny.attiny44.build.variant=tiny14

menu.cpu.attiny.attiny84=ATtiny84
menu.cpu.attiny.attiny84.upload.maximum_size=8192
menu.cpu.attiny.attiny84.build.mcu=attiny84
menu.cpu.attiny.attiny84.build.core=arduino:arduino
menu.cpu.attiny.attiny84.build.variant=tiny14

menu.clock.attiny.internal1=1 MHz (internal)
menu.clock.attiny.internal1.bootloader.low_fuses=0x62
menu.clock.attiny.internal1.bootloader.high_fuses=0xdf
menu.clock.attiny.internal1.bootloader.extended_fuses=0xff
menu.clock.attiny.internal1.build.f_cpu=1000000L

menu.clock.attiny.internal8=8 MHz (internal)
menu.clock.attiny.internal8.bootloader.low_fuses=0xe2
menu.clock.attiny.internal8.bootloader.high_fuses=0xdf
menu.clock.attiny.internal8.bootloader.extended_fuses=0xff
menu.clock.attiny.internal8.build.f_cpu=8000000L

menu.clock.attiny.external8=8 MHz (external)
menu.clock.attiny.external8.bootloader.low_fuses=0xfe
menu.clock.attiny.external8.bootloader.high_fuses=0xdf
menu.clock.attiny.external8.bootloader.extended_fuses=0xff
menu.clock.attiny.external8.build.f_cpu=8000000L

menu.clock.attiny.external16=16 MHz (external)
menu.clock.attiny.external16.bootloader.low_fuses=0xfe
menu.clock.attiny.external16.bootloader.high_fuses=0xdf
menu.clock.attiny.external16.bootloader.extended_fuses=0xff
menu.clock.attiny.external16.build.f_cpu=16000000L

menu.clock.attiny.external20=20 MHz (external)
menu.clock.attiny.external20.bootloader.low_fuses=0xfe
menu.clock.attiny.external20.bootloader.high_fuses=0xdf
menu.clock.attiny.external20.bootloader.extended_fuses=0xff
menu.clock.attiny.external20.build.f_cpu=20000000L
